docs/1c-export-2026-06-02/InformationRegisters/РегистрацияОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>РегистрацияОбмена</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВыгружатьФайлы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Продавец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговыеАгенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИД</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

docs/1c-export-2026-06-02/InformationRegisters/ВыгружатьВАндроидПоТипамЦен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>ВыгружатьВАндроидПоТипамЦен</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Выгружать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТорговийАгент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговыеАгенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

docs/1c-export-2026-06-02/AccumulationRegisters/ТоварыВРезервеНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыВРезервеНаСкладах</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРезерва</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйОрдерНаТовары</v8:Type>
						<v8:Type>cfg:DocumentRef.ВнутреннийЗаказ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

docs/1c-export-2026-06-02/CommonModules/ОбменАндроид/Ext/Module.bsl
Процедура ЗарегистрироватьОбъектОбменАндроидДляПродавца(Объект, Продавец, ВыгружатьФайлы = Ложь) Экспорт
	нз = РегистрыСведений.РегистрацияОбмена.СоздатьНаборЗаписей();
	нз.Отбор.Объект.Использование = Истина;
	нз.Отбор.Продавец.Использование = Истина;
	нз.Отбор.Объект.Значение = Объект;
	нз.Отбор.Продавец.Значение = Продавец;
	
	нз.Прочитать();
	Если нз.Количество() Тогда 
		Если нз[0].ВыгружатьФайлы Тогда 
			Возврат;
		КонецЕсли;
	КонецЕсли;
	нз.Очистить();
	
	
	
	Запись = нз.Добавить();
	Запись.Объект = Объект;                         
	Запись.Продавец = Продавец;
	Запись.ИД = Новый УникальныйИдентификатор();
	Запись.ВыгружатьФайлы = ВыгружатьФайлы;
	нз.Записать();
КонецПроцедуры

Процедура УдалитьРегистрациюПоИД(МассивИД,ПарольВхода) Экспорт
	Продавец = ПолучитьПродавцаПоКодуПартнера(ПарольВхода);
	Для Каждого Строка Из МассивИД Цикл
		нз = РегистрыСведений.РегистрацияОбмена.СоздатьНаборЗаписей();
		нз.Отбор.ИД.Использование = Истина;
		нз.Отбор.Продавец.Использование = Истина;
		нз.Отбор.ИД.Значение = Строка.ИД;
		нз.Отбор.Продавец.Значение = Продавец;
		нз.Записать();                            
	КонецЦикла;
	ВключитьЧастичныйОбмен(ПарольВхода);
КонецПроцедуры                                           

Процедура ЗарегистрироватьОбъектОбменАндроид(Объект,ВыгружатьФайлы = Ложь,ИсключатьПродавца = Ложь,Склад = Неопределено, ТорговийАгент = Неопределено) Экспорт
		
	з = Новый Запрос;
	з.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	          |	СкладыПродавцыПартнера.Ссылка КАК Продавец,
	          |	СкладыПродавцыПартнера.Склад КАК Склад
	          |ИЗ
	          |	Справочник.ТорговыеАгенты КАК СкладыПродавцыПартнера
	          |ГДЕ
	          |	СкладыПродавцыПартнера.ПарольДоступаАндроід <> """"
	          |	И НЕ СкладыПродавцыПартнера.Ссылка.ПометкаУдаления";
	//з.УстановитьПараметр("Склад",Склад);
	//з.УстановитьПараметр("Торговий",ТорговийАгент);

	Выборка = з.Выполнить().Выбрать();
	тзРегистрации = Новый ТаблицаЗначений;
	тзРегистрации.Колонки.Добавить("Объект");
	тзРегистрации.Колонки.Добавить("Продавец");
	тзРегистрации.Колонки.Добавить("ВыгружатьФайлы");

	

	Пока Выборка.Следующий() Цикл
		Если Выборка.Продавец = ИсключатьПродавца ИЛИ (Выборка.Склад <> Склад И Склад <> Неопределено) Тогда 
			Продолжить;
		КонецЕсли;
		
		Если Объект.Метаданные().Имя = "Номенклатура" Тогда 
			ЗапНаСклад = Новый Запрос;
			ЗапНаСклад.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			                   |	НоменклатураСпр.Ссылка
			                   |ИЗ
			                   |	РегистрСведений.ВыгружатьВАндроидПоСкладам КАК ВыгружатьВАндроидПоСкладам
			                   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСпр
			                   |		ПО (ВыгружатьВАндроидПоСкладам.Номенклатура = НоменклатураСпр.Ссылка
			                   |				ИЛИ НоменклатураСпр.Ссылка.Родитель = ВыгружатьВАндроидПоСкладам.Номенклатура
			                   |				ИЛИ НоменклатураСпр.Ссылка.Родитель.Родитель = ВыгружатьВАндроидПоСкладам.Номенклатура
			                   |				ИЛИ НоменклатураСпр.Ссылка.Родитель.Родитель.Родитель = ВыгружатьВАндроидПоСкладам.Номенклатура
			                   |				ИЛИ НоменклатураСпр.Ссылка.Родитель.Родитель.Родитель.Родитель = ВыгружатьВАндроидПоСкладам.Номенклатура
			                   |				ИЛИ НоменклатураСпр.Ссылка.Родитель.Родитель.Родитель.Родитель = ВыгружатьВАндроидПоСкладам.Номенклатура
			                   |				ИЛИ НоменклатураСпр.Ссылка.Родитель.Родитель.Родитель.Родитель.Родитель = ВыгружатьВАндроидПоСкладам.Номенклатура
			                   |				ИЛИ НоменклатураСпр.Ссылка.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель = ВыгружатьВАндроидПоСкладам.Номенклатура
							   |				ИЛИ НоменклатураСпр.Ссылка.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель = ВыгружатьВАндроидПоСкладам.Номенклатура
			                   |				ИЛИ НоменклатураСпр.Ссылка.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель = ВыгружатьВАндроидПоСкладам.Номенклатура
			                   |				ИЛИ НоменклатураСпр.Ссылка.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель = ВыгружатьВАндроидПоСкладам.Номенклатура)
			                   |ГДЕ
			                   |	ВыгружатьВАндроидПоСкладам.ТорговийАгент = &ТорговийАгент
			                   |	И ВыгружатьВАндроидПоСкладам.Выгружать
			                   |	И НоменклатураСпр.Ссылка = &Номенклатура";
			ЗапНаСклад.УстановитьПараметр("ТорговийАгент",Выборка.Продавец);
			ЗапНаСклад.УстановитьПараметр("Номенклатура",Объект.Ссылка);
			ВыборкаСклад = ЗапНаСклад.Выполнить().Выбрать();
			НужноРегистрироватьДляОбмена = Ложь;
			
			Если ВыборкаСклад.Следующий() Тогда 
				НужноРегистрироватьДляОбмена = Истина;
				ВыгружатьФайлы = Ложь;
			КонецЕсли;
		ИначеЕсли Объект.Метаданные().Имя = "Контрагенты" Тогда	
			НужноРегистрироватьДляОбмена = Ложь;
			Если КонтрагентПривязан(Выборка.Продавец, Объект) Тогда 
				НужноРегистрироватьДляОбмена = Истина;
				ВыгружатьФайлы = Ложь;
			КонецЕсли;
		
		Иначе
			НужноРегистрироватьДляОбмена = Ложь;
			Для Каждого Реквизит Из Объект.Метаданные().Реквизиты Цикл 
				Если Реквизит.Имя = "Склад" И Объект.Склад = Выборка.Склад Тогда 
					НужноРегистрироватьДляОбмена = Истина;
				ИначеЕсли  Реквизит.Имя = "СкладОрдер" И Объект.СкладОрдер = Выборка.Склад Тогда 
					НужноРегистрироватьДляОбмена = Истина;
				ИначеЕсли  Реквизит.Имя = "СкладГруппа" И Объект.СкладГруппа = Выборка.Склад Тогда 
					НужноРегистрироватьДляОбмена = Истина;
				ИначеЕсли Реквизит.Имя = "СкладОтправитель" И Объект.СкладОтправитель = Выборка.Склад Тогда 
					НужноРегистрироватьДляОбмена = Истина;
				ИначеЕсли Реквизит.Имя = "СкладПолучатель" И Объект.СкладПолучатель = Выборка.Склад Тогда 
					НужноРегистрироватьДляОбмена = Истина; 	
				ИначеЕсли Реквизит.Имя = "Контрагент" Тогда
						Если КонтрагентПривязан(Выборка.Продавец, Объект.Контрагент) Тогда 
							НужноРегистрироватьДляОбмена = Истина;
							ВыгружатьФайлы = Ложь;
						КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		Если НужноРегистрироватьДляОбмена Тогда 
			СтрРег  = тзРегистрации.Добавить();
			СтрРег.Объект = Объект;
			СтрРег.Продавец = Выборка.Продавец;
			СтрРег.ВыгружатьФайлы = ВыгружатьФайлы;
		КонецЕсли;
	КонецЦикла;	
	
	тзРегистрации.Свернуть("Объект,Продавец","ВыгружатьФайлы");
	Для Каждого СтрРег Из тзРегистрации Цикл
		ЗарегистрироватьОбъектОбменАндроидДляПродавца(СтрРег.Объект, СтрРег.Продавец, СтрРег.ВыгружатьФайлы);
	КонецЦикла;
	
	
	
КонецПроцедуры

Функция КонтрагентПривязан(ТорговийАгент, Контрагент) 
	
	Возврат Контрагент.ТорговыйАгент = ТорговийАгент; //ИЛИ ТорговийАгент.ПолныеПрава;
		
КонецФункции


Функция ПолнаяВыгрузка(КодПартнера) Экспорт 
	Возврат Ложь;
	//з = Новый Запрос;
	//з.Текст = "ВЫБРАТЬ
	//          |	ЧастичнаяВыгрузка.Продавец
	//          |ИЗ
	//          |	РегистрСведений.ЧастичнаяВыгрузка КАК ЧастичнаяВыгрузка
	//          |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТорговыеАгенты КАК СкладыПродавцыПартнера
	//          |		ПО ЧастичнаяВыгрузка.Продавец = СкладыПродавцыПартнера.Ссылка
	//          |ГДЕ
	//          |	СкладыПродавцыПартнера.ПарольДоступаАндроід = &КодПартнера";
	//з.УстановитьПараметр("КодПартнера",КодПартнера);
	//Выборка = з.Выполнить().Выбрать();
	//Если Выборка.Количество() Тогда 
	//	Возврат Ложь;
	//Иначе 
	//	Возврат Истина;
	//КонецЕсли;
КонецФункции

Функция ПолучитьПродавцаПоКодуПартнера(КодПартнера) Экспорт
			з = Новый Запрос;
	з.Текст = "ВЫБРАТЬ
	          |	СкладыПродавцыПартнера.Ссылка КАК Продавец
	          |ИЗ
	          |	Справочник.ТорговыеАгенты КАК СкладыПродавцыПартнера
	          |ГДЕ
	          |	СкладыПродавцыПартнера.ПарольДоступаАндроід = &КодПартнера";
	з.УстановитьПараметр("КодПартнера",КодПартнера);
	Выборка = з.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.Продавец;
	Иначе 
		Возврат Неопределено;
	КонецЕсли;

КонецФункции

Функция ПолучитьСкладПартнера(ПарольВхода) Экспорт
		з = Новый Запрос;
	з.Текст = "ВЫБРАТЬ
	          |	ТорговіАгенти.ТорговыйАгент.Склад КАК Склад
	          |ИЗ
	          |	Справочник.Контрагенты КАК ТорговіАгенти
	          |ГДЕ
	          |	ТорговіАгенти.ТорговыйАгент.ПарольДоступаАндроід = &ПарольДоступаАндроід";
	з.УстановитьПараметр("ПарольДоступаАндроід",ПарольВхода);
	Выборка = з.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.Склад;
	Иначе                        
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Процедура ВключитьЧастичныйОбмен(КодПартнера) Экспорт
	
	Продавец = ПолучитьПродавцаПоКодуПартнера(КодПартнера);
	Если ЗначениеЗаполнено(Продавец) Тогда 
		НЗ = РегистрыСведений.ЧастичнаяВыгрузка.СоздатьНаборЗаписей();
		НЗ.Отбор.Продавец.Использование = Истина;
		НЗ.Отбор.Продавец.Значение = Продавец;
		Запись = НЗ.Добавить();
		Запись.Продавец = Продавец;
		НЗ.Записать();	
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыключитьЧастичныйОбмен(КодПартнера) Экспорт
	
	Продавец = ПолучитьПродавцаПоКодуПартнера(КодПартнера);
	Если ЗначениеЗаполнено(Продавец) Тогда 
		НЗ = РегистрыСведений.ЧастичнаяВыгрузка.СоздатьНаборЗаписей();
		НЗ.Отбор.Продавец.Использование = Истина;
		НЗ.Отбор.Продавец.Значение = Продавец;
		НЗ.Записать();	
	КонецЕсли;
	
КонецПроцедуры

Процедура Лог(Текст) Экспорт
	ЗаписьЖурналаРегистрации("ЛОГ",УровеньЖурналаРегистрации.Информация,Неопределено,Неопределено,Текст);	
КонецПроцедуры

Функция ПолучитьДанныеВыгрузкиАндроид(Склад,Номенклатура) Экспорт
	Стр = Новый Структура;
	Стр.Вставить("ВыгружатьАндроид",Ложь);
	Стр.Вставить("Отображать",Ложь);
		з = Новый Запрос;
			з.Текст = "ВЫБРАТЬ
			          |	ВыгружатьВАндроидПоСкладам.Выгружать КАК Выгружать,
			          |	ВыгружатьВАндроидПоСкладам.ОтображатьВПоиске КАК ОтображатьВПоиске
			          |ИЗ
			          |	РегистрСведений.ВыгружатьВАндроидПоСкладам КАК ВыгружатьВАндроидПоСкладам
			          |ГДЕ
			          |	ВыгружатьВАндроидПоСкладам.ТорговийАгент = &ТорговийАгент
			          |	И ВыгружатьВАндроидПоСкладам.Номенклатура = &Номенклатура";
			з.УстановитьПараметр("ТорговийАгент",Склад);
			з.УстановитьПараметр("Номенклатура",Номенклатура);
			Выборка = з.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда 
				Стр.ВыгружатьАндроид = Выборка.Выгружать;
				Стр.Отображать = Выборка.ОтображатьВПоиске;
			КонецЕсли;
	Возврат Стр;
КонецФункции


Функция ЗаписатьДанныеВыгрузкиНаСайт(ВыгружатьАндроид,Отображать,Ссылка,ТекНом) Экспорт
	//Если ТекНом.ЭтоГруппа Тогда 
	//	Возврат Ложь;
	//КонецЕсли;
	//Склад = ПолучитьСкладПартнераПоТА(Ссылка);
	//Если НЕ ЗначениеЗаполнено(Склад) Тогда 
	//	Возврат Ложь;
	//КонецЕсли;
	ВыгружатьАндроид = НЕ ВыгружатьАндроид;
	
	нз = РегистрыСведений.ВыгружатьВАндроидПоСкладам.СоздатьНаборЗаписей();
	нз.Отбор.ТорговийАгент.Установить(Ссылка);
	нз.Отбор.Номенклатура.Установить(ТекНом);
	Результат = Ложь;
	нз.Прочитать();
	Если нз.Количество() Тогда 
		Для Каждого з Из нз Цикл
			Если з.Выгружать = ВыгружатьАндроид и з.ОтображатьВПоиске = Отображать Тогда
				Возврат Ложь;
			КонецЕсли;
			з.Выгружать = ВыгружатьАндроид;
			з.ОтображатьВПоиске = Отображать;
			Результат = Истина;
		КонецЦикла;	
	Иначе			
		з = нз.Добавить();
		з.Номенклатура = ТекНом;
		з.ТорговийАгент = Ссылка;
		з.Выгружать = ВыгружатьАндроид;
		з.ОтображатьВПоиске = Отображать;
		Результат = Истина;
	КонецЕсли;
	нз.Записать();
	Возврат Результат;
КонецФункции

Функция ПолучитьДанныеВыгрузкиТипЦен(Склад,ТипЦен) Экспорт
	Стр = Новый Структура;
	Стр.Вставить("ВыгружатьТипЦен",Ложь);
	Стр.Вставить("Отображать",Ложь);
		з = Новый Запрос;
			з.Текст = "ВЫБРАТЬ
			          |	ВыгружатьВАндроидПоСкладам.Выгружать КАК Выгружать
			          |ИЗ
			          |	РегистрСведений.ВыгружатьВАндроидПоТипамЦен КАК ВыгружатьВАндроидПоСкладам
			          |ГДЕ
			          |	ВыгружатьВАндроидПоСкладам.ТорговийАгент = &ТорговийАгент
			          |	И ВыгружатьВАндроидПоСкладам.ТипЦен = &ТипЦен";
			з.УстановитьПараметр("ТорговийАгент",Склад);
			з.УстановитьПараметр("ТипЦен",ТипЦен);
			Выборка = з.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда 
				Стр.ВыгружатьТипЦен = Выборка.Выгружать;
			КонецЕсли;
	Возврат Стр;
КонецФункции


Функция ЗаписатьДанныеВыгрузкиТипЦен(ВыгружатьАндроид,Отображать,Ссылка,ТекНом) Экспорт
	//Если ТекНом.ЭтоГруппа Тогда 
	//	Возврат Ложь;
	//КонецЕсли;
	//Склад = ПолучитьСкладПартнераПоТА(Ссылка);
	//Если НЕ ЗначениеЗаполнено(Склад) Тогда 
	//	Возврат Ложь;
	//КонецЕсли;
	ВыгружатьАндроид = НЕ ВыгружатьАндроид;
	
	нз = РегистрыСведений.ВыгружатьВАндроидПоТипамЦен.СоздатьНаборЗаписей();
	нз.Отбор.ТорговийАгент.Установить(Ссылка);
	нз.Отбор.ТипЦен.Установить(ТекНом);
	Результат = Ложь;
	нз.Прочитать();
	Если нз.Количество() Тогда 
		Для Каждого з Из нз Цикл
			Если з.Выгружать = ВыгружатьАндроид Тогда
				Возврат Ложь;
			КонецЕсли;
			з.Выгружать = ВыгружатьАндроид;
			Результат = Истина;
		КонецЦикла;	
	Иначе			
		з = нз.Добавить();
		з.ТипЦен = ТекНом;
		з.ТорговийАгент = Ссылка;
		з.Выгружать = ВыгружатьАндроид;

		Результат = Истина;
	КонецЕсли;
	нз.Записать();
	Возврат Результат;
КонецФункции

Функция ПолучитьСкладПартнераПоТА(ТорговыйАгент) Экспорт
		з = Новый Запрос;
	з.Текст = "ВЫБРАТЬ
	          |	ТорговіАгенти.Склад,
	          |	ТорговіАгенти.ТорговийАгент.Склад КАК ОсновнийСклад
	          |ИЗ
	          |	РегистрСведений.ТорговіАгенти КАК ТорговіАгенти
	          |ГДЕ
	          |	ТорговіАгенти.ТорговийАгент = &ТорговыйАгент";
	з.УстановитьПараметр("ТорговыйАгент",ТорговыйАгент);
	Выборка = з.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Если ЗначениеЗаполнено(Выборка.Склад) Тогда 
			Возврат Выборка.Склад;
		Иначе 
			Возврат Выборка.ОсновнийСклад;
		КонецЕсли;
	Иначе                        
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьТАПоСкладу(Склад) Экспорт
		з = Новый Запрос;
	з.Текст = "ВЫБРАТЬ
	          |	ТорговіАгенти.ТорговийАгент КАК ТорговийАгент
	          |ИЗ
	          |	РегистрСведений.ТорговіАгенти КАК ТорговіАгенти
	          |ГДЕ
	          |	ТорговіАгенти.Склад = &Склад";
	з.УстановитьПараметр("Склад",Склад);
	Выборка = з.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.ТорговийАгент;
	Иначе                        
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции



Процедура ЗаписатьДанныеВыгрузкиНаСайтПоДокументу(Документ,Склад)Экспорт
	Если Не ЗначениеЗаполнено(Склад.Партнер) Тогда 
		Возврат;
	КонецЕсли;
	
	Для Каждого Строка Из Документ.Товары Цикл
		Записано = ЗаписатьДанныеВыгрузкиНаСайт(Истина,Истина,Склад,Строка.Номенклатура);
		Если Записано Тогда 
			Для Каждого СтрокаПродавец Из Склад.ПродавцыПартнера Цикл
				ЗарегистрироватьОбъектОбменАндроидДляПродавца(Строка.Номенклатура, СтрокаПродавец.Продавец, Истина);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

		
Функция ПолучитьОстаток(Номенклатура,Склад) Экспорт
	з = Новый Запрос;
	з.Текст = "ВЫБРАТЬ
	          |	СУММА(ТоварыНаСкладахОстатки.КоличествоОстаток - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0)) КАК Остаток
	          |ИЗ
	          |	РегистрНакопления.ТоварыНаСкладах.Остатки(
	          |			,
	          |			Номенклатура = &Номенклатура
	          |				И Склад = &Склад) КАК ТоварыНаСкладахОстатки
	          |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(
	          |				,
	          |				Номенклатура = &Номенклатура
	          |					И Склад = &Склад) КАК ТоварыВРезервеНаСкладахОстатки
	          |		ПО ТоварыНаСкладахОстатки.Номенклатура = ТоварыВРезервеНаСкладахОстатки.Номенклатура
	          |			И ТоварыНаСкладахОстатки.Склад = ТоварыВРезервеНаСкладахОстатки.Склад
	          |			И ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры = ТоварыВРезервеНаСкладахОстатки.ХарактеристикаНоменклатуры";
	з.УстановитьПараметр("Номенклатура",Номенклатура);
	з.УстановитьПараметр("Склад",Склад);
	Выборка = з.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.Остаток;
	Иначе
		Возврат 0;
	КонецЕсли;
КонецФункции

Функция ПолучитьНормуЗапаса(Номенклатура,Склад) Экспорт
	Возврат 0;

КонецФункции

Функция ПолучитьТорговыхЗаданнойНоменклатуры(Номенклатура) Экспорт
	з = Новый Запрос;
	з.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	          |	ВыгружатьВАндроидПоСкладам.ТорговийАгент КАК ТорговийАгент
	          |ИЗ
	          |	РегистрСведений.ВыгружатьВАндроидПоСкладам КАК ВыгружатьВАндроидПоСкладам
	          |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	          |			НоменклатураСпр.Ссылка КАК Ссылка
	          |		ИЗ
	          |			Справочник.Номенклатура КАК НоменклатураСпр
	          |		ГДЕ
	          |			НоменклатураСпр.Ссылка = &Номенклатура) КАК НоменклатураСпр
	          |		ПО (ВыгружатьВАндроидПоСкладам.Номенклатура = НоменклатураСпр.Ссылка
	          |				ИЛИ НоменклатураСпр.Ссылка.Родитель = ВыгружатьВАндроидПоСкладам.Номенклатура
	          |				ИЛИ НоменклатураСпр.Ссылка.Родитель.Родитель = ВыгружатьВАндроидПоСкладам.Номенклатура
	          |				ИЛИ НоменклатураСпр.Ссылка.Родитель.Родитель.Родитель = ВыгружатьВАндроидПоСкладам.Номенклатура
	          |				ИЛИ НоменклатураСпр.Ссылка.Родитель.Родитель.Родитель.Родитель = ВыгружатьВАндроидПоСкладам.Номенклатура
	          |				ИЛИ НоменклатураСпр.Ссылка.Родитель.Родитель.Родитель.Родитель.Родитель = ВыгружатьВАндроидПоСкладам.Номенклатура
	          |				ИЛИ НоменклатураСпр.Ссылка.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель = ВыгружатьВАндроидПоСкладам.Номенклатура
	          |				ИЛИ НоменклатураСпр.Ссылка.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель = ВыгружатьВАндроидПоСкладам.Номенклатура
	          |				ИЛИ НоменклатураСпр.Ссылка.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель = ВыгружатьВАндроидПоСкладам.Номенклатура
	          |				ИЛИ НоменклатураСпр.Ссылка.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель = ВыгружатьВАндроидПоСкладам.Номенклатура
	          |				ИЛИ НоменклатураСпр.Ссылка.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель = ВыгружатьВАндроидПоСкладам.Номенклатура)
	          |			И (ВыгружатьВАндроидПоСкладам.Выгружать)
	          |ГДЕ
	          |	ВыгружатьВАндроидПоСкладам.Выгружать
	          |	И ВыгружатьВАндроидПоСкладам.ТорговийАгент.ПарольДоступаАндроід <> """"
	          |	И НЕ НоменклатураСпр.Ссылка.ПометкаУдаления
	          |	И НЕ НоменклатураСпр.Ссылка.ЭтоГруппа
	          |	И НЕ ВыгружатьВАндроидПоСкладам.ТорговийАгент.ПометкаУдаления
	          |
	          |СГРУППИРОВАТЬ ПО
	          |	ВыгружатьВАндроидПоСкладам.ТорговийАгент";
	
	
	з.УстановитьПараметр("Номенклатура", Номенклатура);
	Возврат з.Выполнить().Выгрузить().ВыгрузитьКолонку("ТорговийАгент");
КонецФункции
